# FamilyDoesntMatchSystemPropertiesDisconnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyDoesntMatchSystemPropertiesDisconnected Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The family no longer matches the properties for the System. Disconnect the family from the System?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyDoesntMatchSystemPropertiesDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemPropertiesDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace